Continued apply output from previous comment.
<details><summary>Show Output</summary>

```diff
213313200"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.lambda-pluginConsequence.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-pluginConsequence"
      ~ image_uri                      = "460722568061.dkr.ecr.ap-southeast-3.amazonaws.com/svep-pluginconsequence-lambda-containers@sha256:60bb93badb1c68ef9be2d4983ec8ee7d266f795521d9257c09daee567d2b24ed" -> (known after apply)
      ~ last_modified                  = "2025-09-23T03:27:08.000+0000" -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "FILTER_CONSEQUENCE_RANK"         = "14" -> "12"
                # (12 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-pluginGnomad.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-pluginGnomad"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_binaries_layer:16",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_python_modules_layer:23",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-pluginGnomad.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "8924651689206392269" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758615149352602000" -> "1758771080571874000"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.lambda-pluginGnomadConstraint.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-pluginGnomadConstraint"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_binaries_layer:16",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_python_modules_layer:23",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-pluginGnomadConstraint.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "5436808525856470330" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758615148320055000" -> "1758771081333260000"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.lambda-pluginGnomadOneKG.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/2787485a16b1496b051eb7407947a32276b1e6700896621f8bb978248d08edeb.zip" -> "builds/57ccd6b4cd189e080861aba247c1d5bde35c03e555b93b8a9fe76cff8fbae565.zip"
        id                             = "svep-backend-pluginGnomadOneKG"
      ~ last_modified                  = "2025-09-23T08:15:37.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_binaries_layer:16",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_python_modules_layer:23",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-pluginGnomadOneKG.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "svep/lambda/pluginGnomadOneKG",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/57ccd6b4cd189e080861aba247c1d5bde35c03e555b93b8a9fe76cff8fbae565.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/57ccd6b4cd189e080861aba247c1d5bde35c03e555b93b8a9fe76cff8fbae565.plan.json"
      + id                   = (known after apply)
    }

  # module.svep[0].module.lambda-pluginGnomadOneKG.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "2969546889148228670" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/2787485a16b1496b051eb7407947a32276b1e6700896621f8bb978248d08edeb.zip" -> "builds/57ccd6b4cd189e080861aba247c1d5bde35c03e555b93b8a9fe76cff8fbae565.zip"
          ~ "timestamp" = "1758615149532911000" -> "1758771079962518000"
        }
    }

  # module.svep[0].module.lambda-qcFigures.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-qcFigures"
      ~ image_uri                      = "460722568061.dkr.ecr.ap-southeast-3.amazonaws.com/svep-qcfigures-lambda-containers@sha256:bf6187b0d174fc52d51ebcd13aa71cf4bc4a0b9a6ab452b1df9af31bb3ee34f4" -> (known after apply)
      ~ last_modified                  = "2025-09-23T08:31:39.000+0000" -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-qcNotes.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-qcNotes"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_python_modules_layer:23",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-qcNotes.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "8650525206572069298" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758615148282564000" -> "1758771075894411000"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.lambda-queryGTF.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-queryGTF"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_binaries_layer:16",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_python_modules_layer:23",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-queryGTF.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "766981139147289181" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758615149720958000" -> "1758771080827668000"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.lambda-queryVCF.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-queryVCF"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_binaries_layer:16",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_python_modules_layer:23",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-queryVCF.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1942618129850876387" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758615148528700200" -> "1758771080816400000"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.lambda-queryVCFsubmit.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-queryVCFsubmit"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_python_modules_layer:23",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-queryVCFsubmit.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1767351841877624738" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758615149275331000" -> "1758771080856831000"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.lambda-sendJobEmail.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-sendJobEmail"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_binaries_layer:16",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_python_modules_layer:23",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-sendJobEmail.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "4505080159849899836" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758615148779655000" -> "1758771081220136800"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.lambda-updateReferenceFiles.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-updateReferenceFiles"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_binaries_layer:16",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_python_modules_layer:23",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-updateReferenceFiles.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "6567832312731013674" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758615148110711000" -> "1758771078565591000"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.python_modules_layer.aws_lambda_layer_version.this[0] must be replaced
+/- resource "aws_lambda_layer_version" "this" {
      ~ arn                         = "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_python_modules_layer:23" -> (known after apply)
      ~ code_sha256                 = "UMWQ8eYC3M55DWKE5tgaFfDWNnI8CjHl6RgZkNx24lM=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2025-09-23T08:15:25.952+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_python_modules_layer:23" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_python_modules_layer" -> (known after apply)
      ~ s3_key                      = "builds/b6d4ebf67024f0d058e31dec4d0b9fa07411331d70cdf3b45ef6ef0e25f24395.zip" -> "builds/baa8cfb19ae12c93eaaafb7bac6e777721a9b4a1c073d5a5e3171eef731fe1cc.zip" # forces replacement
      + s3_object_version           = (known after apply) # forces replacement
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      + source_code_hash            = (known after apply)
      ~ source_code_size            = 37627 -> (known after apply)
      ~ version                     = "23" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.svep[0].module.python_modules_layer.aws_s3_object.lambda_package[0] must be replaced
+/- resource "aws_s3_object" "lambda_package" {
      ~ arn                           = "arn:aws:s3:::svep-backend-layers-20250815040234005900000003/builds/b6d4ebf67024f0d058e31dec4d0b9fa07411331d70cdf3b45ef6ef0e25f24395.zip" -> (known after apply)
      ~ bucket_key_enabled            = false -> (known after apply)
      + checksum_crc32                = (known after apply)
      + checksum_crc32c               = (known after apply)
      + checksum_crc64nvme            = (known after apply)
      + checksum_sha1                 = (known after apply)
      + checksum_sha256               = (known after apply)
      ~ content_type                  = "application/octet-stream" -> (known after apply)
      ~ etag                          = "fffb8e2cb2fe29ccf9f26afb3cb2bcaa" -> (known after apply)
      ~ id                            = "svep-backend-layers-20250815040234005900000003/builds/b6d4ebf67024f0d058e31dec4d0b9fa07411331d70cdf3b45ef6ef0e25f24395.zip" -> (known after apply)
      ~ key                           = "builds/b6d4ebf67024f0d058e31dec4d0b9fa07411331d70cdf3b45ef6ef0e25f24395.zip" -> "builds/baa8cfb19ae12c93eaaafb7bac6e777721a9b4a1c073d5a5e3171eef731fe1cc.zip" # forces replacement
      + kms_key_id                    = (known after apply)
      - metadata                      = {} -> null
      ~ server_side_encryption        = "AES256" -> (known after apply)
      ~ source                        = "builds/b6d4ebf67024f0d058e31dec4d0b9fa07411331d70cdf3b45ef6ef0e25f24395.zip" -> "builds/baa8cfb19ae12c93eaaafb7bac6e777721a9b4a1c073d5a5e3171eef731fe1cc.zip"
      - tags                          = {} -> null
      ~ tags_all                      = {} -> (known after apply)
      + version_id                    = (known after apply)
        # (13 unchanged attributes hidden)
    }

  # module.svep[0].module.python_modules_layer.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "svep/shared_resources/python-modules/",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/baa8cfb19ae12c93eaaafb7bac6e777721a9b4a1c073d5a5e3171eef731fe1cc.zip"
              + runtime       = ""
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/baa8cfb19ae12c93eaaafb7bac6e777721a9b4a1c073d5a5e3171eef731fe1cc.plan.json"
      + id                   = (known after apply)
    }

  # module.svep[0].module.python_modules_layer.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "5183122638446966270" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/b6d4ebf67024f0d058e31dec4d0b9fa07411331d70cdf3b45ef6ef0e25f24395.zip" -> "builds/baa8cfb19ae12c93eaaafb7bac6e777721a9b4a1c073d5a5e3171eef731fe1cc.zip"
          ~ "timestamp" = "1758615148817967000" -> "1758771081630282000"
        }
    }

Plan: 77 to add, 52 to change, 65 to destroy.
module.webgui.terraform_data.cloudfront-version-invalidate: Destroying... [id=ba70017e-e569-6054-eaf2-9a376faeaf97]
module.webgui.terraform_data.cloudfront-version-invalidate: Destruction complete after 0s
module.webgui.null_resource.cloudfront-invalidate: Destroying... [id=4857698419747107289]
module.webgui.null_resource.cloudfront-invalidate: Destruction complete after 0s
module.error-catcher.module.lambda-notifyOnError.null_resource.archive[0]: Creating...
module.security.module.lambda-sendSecurityAlert.null_resource.archive[0]: Creating...
module.security.module.lambda-sendSecurityAlert.null_resource.archive[0]: Provisioning with 'local-exec'...
module.security.module.lambda-sendSecurityAlert.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.error-catcher.module.lambda-notifyOnError.null_resource.archive[0]: Provisioning with 'local-exec'...
module.error-catcher.module.lambda-notifyOnError.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.sbeacon.module.lambda-deidentifyFiles.null_resource.archive[0]: Creating...
module.sbeacon.module.lambda-updateFiles.null_resource.archive[0]: Creating...
module.cognito.module.lambda-logEmailDelivery.null_resource.archive[0]: Creating...
module.cognito.module.lambda-logEmailDelivery.null_resource.archive[0]: Provisioning with 'local-exec'...
module.cognito.module.lambda-logEmailDelivery.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.sbeacon.module.lambda-deidentifyFiles.null_resource.archive[0]: Provisioning with 'local-exec'...
module.sbeacon.module.lambda-deidentifyFiles.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.sbeacon.module.lambda-updateFiles.null_resource.archive[0]: Provisioning with 'local-exec'...
module.sbeacon.module.lambda-updateFiles.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.svep[0].module.lambda-formatOutput.local_file.archive_plan[0]: Creating...
module.svep[0].module.lambda-formatOutput.local_file.archive_plan[0]: Creation complete after 0s [id=3f0ae7b59ab4267677286a5dc583879c0191ced2]
module.svep[0].module.lambda-pluginGnomadOneKG.local_file.archive_plan[0]: Creating...
module.svep[0].module.lambda-pluginGnomadOneKG.local_file.archive_plan[0]: Creation complete after 0s [id=387ea358ad70b542838b3ea85e649e5ab26ea54a]
module.webgui.null_resource.s3-upload: Destroying... [id=7501596788654961346]
module.webgui.null_resource.s3-upload: Destruction complete after 0s
module.svep[0].module.lambda-concatPages.null_resource.archive[0]: Creating...
module.svep[0].module.lambda-pluginGnomadConstraint.null_resource.archive[0]: Creating...
module.svep[0].module.lambda-pluginGnomadConstraint.null_resource.archive[0]: Provisioning with 'local-exec'...
module.svep[0].module.lambda-pluginGnomadConstraint.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.svep[0].module.lambda-concatPages.null_resource.archive[0]: Provisioning with 'local-exec'...
module.svep[0].module.lambda-concatPages.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.svep[0].module.lambda-batchStarter.null_resource.archive[0]: Creating...
module.svep[0].module.lambda-batchStarter.null_resource.archive[0]: Provisioning with 'local-exec'...
module.svep[0].module.lambda-batchStarter.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.sbeacon.module.lambda-updateFiles.null_resource.archive[0] (local-exec): zip: creating 'builds/af5bf3b9b67b07d522efa9b0e7ffedcccb023517fee892632475f08f4f7d282c.zip' archive
module.sbeacon.module.lambda-updateFiles.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/297/default/sbeacon/lambda/updateFiles
module.sbeacon.module.lambda-updateFiles.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.sbeacon.module.lambda-updateFiles.null_resource.archive[0] (local-exec): Created: builds/af5bf3b9b67b07d522efa9b0e7ffedcccb023517fee892632475f08f4f7d282c.zip
module.sbeacon.module.lambda-updateFiles.null_resource.archive[0]: Creation complete after 0s [id=299335258147077932]
module.error-catcher.module.lambda-notifyOnError.null_resource.archive[0] (local-exec): zip: creating 'builds/2a659c5c68d0b5aade4d65d796c0c1cf81a569749317424275d2a0f412026e07.zip' archive
module.error-catcher.module.lambda-notifyOnError.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/297/default/error_catcher/lambda/notifyOnError
module.error-catcher.module.lambda-notifyOnError.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.error-catcher.module.lambda-notifyOnError.null_resource.archive[0] (local-exec): Created: builds/2a659c5c68d0b5aade4d65d796c0c1cf81a569749317424275d2a0f412026e07.zip
module.svep[0].module.lambda-pluginClinvar.null_resource.archive[0]: Creating...
module.svep[0].module.lambda-pluginClinvar.null_resource.archive[0]: Provisioning with 'local-exec'...
module.svep[0].module.lambda-pluginClinvar.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.error-catcher.module.lambda-notifyOnError.null_resource.archive[0]: Creation complete after 1s [id=5969700234761203112]
module.sbeacon.module.lambda-deidentifyFiles.null_resource.archive[0] (local-exec): zip: creating 'builds/5a6513a124539d405e198f8b667d222b031442e312b7167506d63dc12fb79547.zip' archive
module.sbeacon.module.lambda-deidentifyFiles.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/297/default/sbeacon/lambda/deidentifyFiles
module.sbeacon.module.lambda-deidentifyFiles.null_resource.archive[0] (local-exec): zip: adding: deidentification.py
module.sbeacon.module.lambda-deidentifyFiles.null_resource.archive[0] (local-exec): zip: adding: file_validation.py
module.sbeacon.module.lambda-deidentifyFiles.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.sbeacon.module.lambda-deidentifyFiles.null_resource.archive[0] (local-exec): zip: adding: launch_ec2.py
module.sbeacon.module.lambda-deidentifyFiles.null_resource.archive[0] (local-exec): Created: builds/5a6513a124539d405e198f8b667d222b031442e312b7167506d63dc12fb79547.zip
module.svep[0].module.lambda-updateReferenceFiles.null_resource.archive[0]: Creating...
module.svep[0].module.lambda-updateReferenceFiles.null_resource.archive[0]: Provisioning with 'local-exec'...
module.svep[0].module.lambda-updateReferenceFiles.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.cognito.module.lambda-logEmailDelivery.null_resource.archive[0] (local-exec): zip: creating 'builds/a8f4f52fd2bf74768358bcc93ef19fd9d4225b9b50c6d2604117f5d6f0ff138a.zip' archive
module.cognito.module.lambda-logEmailDelivery.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/297/default/cognito/lambda/logEmailDelivery
module.cognito.module.lambda-logEmailDelivery.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.cognito.module.lambda-logEmailDelivery.null_resource.archive[0] (local-exec): Created: builds/a8f4f52fd2bf74768358bcc93ef19fd9d4225b9b50c6d2604117f5d6f0ff138a.zip
module.cognito.module.lambda-logEmailDelivery.null_resource.archive[0]: Creation complete after 1s [id=425789173436335695]
module.security.module.lambda-sendSecurityAlert.null_resource.archive[0] (local-exec): zip: creating 'builds/a5192d6c6931daa312a9d5196c8dd48db9f131a2a75a71add835dc60c9c5671f.zip' archive
module.security.module.lambda-sendSecurityAlert.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/297/default/security/lambda/sendSecurityAlert
module.security.module.lambda-sendSecurityAlert.null_resource.archive[0] (local-exec): zip: adding: inspector.py
module.security.module.lambda-sendSecurityAlert.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.security.module.lambda-sendSecurityAlert.null_resource.archive[0] (local-exec): Created: builds/a5192d6c6931daa312a9d5196c8dd48db9f131a2a75a71add835dc60c9c5671f.zip
module.sbeacon.module.lambda-deidentifyFiles.null_resource.archive[0]: Creation complete after 1s [id=1905682261484260087]
module.svep[0].module.lambda-concatStarter.null_resource.archive[0]: Creating...
module.svep[0].module.lambda-concatStarter.null_resource.archive[0]: Provisioning with 'local-exec'...
module.svep[0].module.lambda-concatStarter.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.svep[0].module.lambda-concatPages.null_resource.archive[0] (local-exec): zip: creating 'builds/e32e7bc23825285db2c8e77e4c438ef201a02c80f66935d59fd271ec6be661b9.zip' archive
module.svep[0].module.lambda-concatPages.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/297/default/svep/lambda/concatPages
module.svep[0].module.lambda-concatPages.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.svep[0].module.lambda-concatPages.null_resource.archive[0] (local-exec): Created: builds/e32e7bc23825285db2c8e77e4c438ef201a02c80f66935d59fd271ec6be661b9.zip
module.svep[0].module.lambda-concatPages.null_resource.archive[0]: Creation complete after 1s [id=1781029530984292988]
module.security.module.lambda-sendSecurityAlert.null_resource.archive[0]: Creation complete after 1s [id=4164223395043020236]
module.svep[0].module.lambda-concat.null_resource.archive[0]: Creating...
module.svep[0].module.lambda-queryVCFsubmit.null_resource.archive[0]: Creating...
module.svep[0].module.lambda-queryVCF.null_resource.archive[0]: Creating...
module.svep[0].module.lambda-createPages.null_resource.archive[0]: Creating...
module.svep[0].module.lambda-pluginGnomadConstraint.null_resource.archive[0] (local-exec): zip: creating 'builds/58619988e72b30a1935fb3a192a1bc4832cd3330e8380e8df397e9c7e4c8f9c8.zip' archive
module.svep[0].module.lambda-pluginGnomadConstraint.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/297/default/svep/lambda/pluginGnomadConstraint
module.svep[0].module.lambda-pluginGnomadConstraint.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.svep[0].module.lambda-pluginGnomadConstraint.null_resource.archive[0] (local-exec): Created: builds/58619988e72b30a1935fb3a192a1bc4832cd3330e8380e8df397e9c7e4c8f9c8.zip
module.svep[0].module.lambda-pluginGnomadConstraint.null_resource.archive[0]: Creation complete after 1s [id=4634908660758166107]
module.svep[0].module.lambda-concat.null_resource.archive[0]: Provisioning with 'local-exec'...
module.svep[0].module.lambda-concat.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.svep[0].module.lambda-queryVCF.null_resource.archive[0]: Provisioning with 'local-exec'...
module.svep[0].module.lambda-queryVCF.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.svep[0].module.lambda-queryVCFsubmit.null_resource.archive[0]: Provisioning with 'local-exec'...
module.svep[0].module.lambda-queryVCFsubmit.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.svep[0].module.lambda-queryGTF.null_resource.archive[0]: Creating...
module.svep[0].module.lambda-queryGTF.null_resource.archive[0]: Provisioning with 'local-exec'...
module.svep[0].module.lambda-queryGTF.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.svep[0].module.lambda-createPages.null_resource.archive[0]: Provisioning with 'local-exec'...
module.svep[0].module.lambda-createPages.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.svep[0].module.lambda-batchStarter.null_resource.archive[0] (local-exec): zip: creating 'builds/b030658b75389390c47d5caf79154ea6d13e9484ce2ebf4038fca1eddda3fdd8.zip' archive
module.svep[0].module.lambda-batchStarter.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/297/default/svep/lambda/batchStarter
module.svep[0].module.lambda-batchStarter.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.svep[0].module.lambda-batchStarter.null_resource.archive[0] (local-exec): Created: builds/b030658b75389390c47d5caf79154ea6d13e9484ce2ebf4038fca1eddda3fdd8.zip
module.svep[0].module.lambda-batchStarter.null_resource.archive[0]: Creation complete after 1s [id=5427392879290669836]
module.svep[0].module.lambda-sendJobEmail.null_resource.archive[0]: Creating...
module.svep[0].module.lambda-sendJobEmail.null_resource.archive[0]: Provisioning with 'local-exec'...
module.svep[0].module.lambda-sendJobEmail.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.svep[0].module.lambda-pluginClinvar.null_resource.archive[0] (local-exec): zip: creating 'builds/0629f553e0d9d4c0c3bcc2f6571ed245b9f759b5d35f2a88fcd9efede5ec63af.zip' archive
module.svep[0].module.lambda-pluginClinvar.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/297/default/svep/lambda/pluginClinvar
module.svep[0].module.lambda-pluginClinvar.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.svep[0].module.lambda-pluginClinvar.null_resource.archive[0] (local-exec): Created: builds/0629f553e0d9d4c0c3bcc2f6571ed245b9f759b5d35f2a88fcd9efede5ec63af.zip
module.svep[0].module.lambda-updateReferenceFiles.null_resource.archive[0] (local-exec): zip: creating 'builds/0bc11a361954aaac54be05525f7b6b7d819b5c2de7890264e819c10fa037f29b.zip' archive
module.svep[0].module.lambda-updateReferenceFiles.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/297/default/svep/lambda/updateReferenceFiles
module.svep[0].module.lambda-updateReferenceFiles.null_resource.archive[0] (local-exec): zip: adding: clinvar.py
module.svep[0].module.lambda-updateReferenceFiles.null_resource.archive[0] (local-exec): zip: adding: clinvar.sh
module.svep[0].module.lambda-updateReferenceFiles.null_resource.archive[0] (local-exec): zip: adding: clinvar_xmltobed.py
module.svep[0].module.lambda-updateReferenceFiles.null_resource.archive[0] (local-exec): zip: adding: constraints.py
module.svep[0].module.lambda-pluginClinvar.null_resource.archive[0]: Creation complete after 1s [id=3033765974962403168]
module.svep[0].module.lambda-updateReferenceFiles.null_resource.archive[0] (local-exec): zip: adding: ensembl.py
module.svep[0].module.lambda-updateReferenceFiles.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.svep[0].module.lambda-updateReferenceFiles.null_resource.archive[0] (local-exec): zip: adding: mirna.py
module.svep[0].module.lambda-updateReferenceFiles.null_resource.archive[0] (local-exec): zip: adding: version_checks.py
module.svep[0].module.lambda-updateReferenceFiles.null_resource.archive[0] (local-exec): Created: builds/0bc11a361954aaac54be05525f7b6b7d819b5c2de7890264e819c10fa037f29b.zip
module.sbeacon.module.lambda-getGenomicVariants.null_resource.archive[0]: Creating...
module.sbeacon.module.lambda-getGenomicVariants.null_resource.archive[0]: Provisioning with 'local-exec'...
module.sbeacon.module.lambda-getGenomicVariants.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.svep[0].module.lambda-concatStarter.null_resource.archive[0] (local-exec): zip: creating 'builds/4dbaff60e6cff0035b0719661c0d997df409a3c6c595846c8d86d93a15e50817.zip' archive
module.svep[0].module.lambda-concatStarter.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/297/default/svep/lambda/concatStarter
module.svep[0].module.lambda-concatStarter.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.svep[0].module.lambda-concatStarter.null_resource.archive[0] (local-exec): Created: builds/4dbaff60e6cff0035b0719661c0d997df409a3c6c595846c8d86d93a15e50817.zip
module.svep[0].module.lambda-updateReferenceFiles.null_resource.archive[0]: Creation complete after 0s [id=2384257887292041971]
module.sbeacon.module.lambda-getIndividuals.null_resource.archive[0]: Creating...
module.svep[0].module.lambda-concatStarter.null_resource.archive[0]: Creation complete after 0s [id=8786490764140277938]
module.sbeacon.module.lambda-getIndividuals.null_resource.archive[0]: Provisioning with 'local-exec'...
module.sbeacon.module.lambda-getIndividuals.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.svep[0].module.lambda-initQuery.null_resource.archive[0]: Creating...
module.svep[0].module.lambda-initQuery.null_resource.archive[0]: Provisioning with 'local-exec'...
module.svep[0].module.lambda-initQuery.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.svep[0].module.lambda-concat.null_resource.archive[0] (local-exec): zip: creating 'builds/52961fb8310c601e9a92b8931c8a754ccf650ffe0a78f8c268a29ccf2104d630.zip' archive
module.svep[0].module.lambda-queryVCFsubmit.null_resource.archive[0] (local-exec): zip: creating 'builds/1bd66140491a106ea4acdcea0b4086f7b4c132551e1fd188039bb3f352e29547.zip' archive
module.svep[0].module.lambda-queryVCFsubmit.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/297/default/svep/lambda/queryVCFsubmit
module.svep[0].module.lambda-queryVCFsubmit.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.svep[0].module.lambda-queryVCFsubmit.null_resource.archive[0] (local-exec): Created: builds/1bd66140491a106ea4acdcea0b4086f7b4c132551e1fd188039bb3f352e29547.zip
module.svep[0].module.lambda-concat.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/297/default/svep/lambda/concat
module.svep[0].module.lambda-concat.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.svep[0].module.lambda-concat.null_resource.archive[0] (local-exec): Created: builds/52961fb8310c601e9a92b8931c8a754ccf650ffe0a78f8c268a29ccf2104d630.zip
module.svep[0].module.lambda-queryVCFsubmit.null_resource.archive[0]: Creation complete after 0s [id=2309720599431512878]
module.svep[0].module.lambda-getResultsURL.null_resource.archive[0]: Creating...
module.svep[0].module.lambda-getResultsURL.null_resource.archive[0]: Provisioning with 'local-exec'...
module.svep[0].module.lambda-getResultsURL.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.svep[0].module.lambda-concat.null_resource.archive[0]: Creation complete after 0s [id=4458972086562900408]
module.sbeacon.module.lambda-getAnalyses.null_resource.archive[0]: Creating...
module.sbeacon.module.lambda-getAnalyses.null_resource.archive[0]: Provisioning with 'local-exec'...
module.sbeacon.module.lambda-getAnalyses.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.svep[0].module.lambda-createPages.null_resource.archive[0] (local-exec): zip: creating 'builds/03e47b8673762c54e2f7762675cd423c0bebdb5bd1cb7f4a0573c8ed171d086c.zip' archive
module.svep[0].module.lambda-queryVCF.null_resource.archive[0] (local-exec): zip: creating 'builds/aafb45684d944fa8a5f32817ab2e88b726c7c282e4eedf436cd6cbf16e2f86c5.zip' archive
module.svep[0].module.lambda-queryVCF.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/297/default/svep/lambda/queryVCF
module.svep[0].module.lambda-queryVCF.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.svep[0].module.lambda-createPages.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/297/default/svep/lambda/createPages
module.svep[0].module.lambda-queryVCF.null_resource.archive[0] (local-exec): Created: builds/aafb45684d944fa8a5f32817ab2e88b726c7c282e4eedf436cd6cbf16e2f86c5.zip
module.svep[0].module.lambda-sendJobEmail.null_resource.archive[0] (local-exec): zip: creating 'builds/c36b6002136a7854703acbc9429139185c5c1865d831b1a6429ec678890776f2.zip' archive
module.svep[0].module.lambda-createPages.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.svep[0].module.lambda-createPages.null_resource.archive[0] (local-exec): Created: builds/03e47b8673762c54e2f7762675cd423c0bebdb5bd1cb7f4a0573c8ed171d086c.zip
module.svep[0].module.lambda-sendJobEmail.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/297/default/svep/lambda/sendJobEmail
module.svep[0].module.lambda-sendJobEmail.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.svep[0].module.lambda-sendJobEmail.null_resource.archive[0] (local-exec): Created: builds/c36b6002136a7854703acbc9429139185c5c1865d831b1a6429ec678890776f2.zip
module.svep[0].module.lambda-sendJobEmail.null_resource.archive[0]: Creation complete after 0s [id=3638647154032546910]
module.svep[0].module.lambda-queryGTF.null_resource.archive[0] (local-exec): zip: creating 'builds/a67365d52781e62bb07c35372e6a327f313eb419234d8ed967ed45860fecd179.zip' archive
module.svep[0].module.lambda-queryGTF.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/297/default/svep/lambda/queryGTF
module.svep[0].module.lambda-queryGTF.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.svep[0].module.lambda-queryGTF.null_resource.archive[0] (local-exec): Created: builds/a67365d52781e62bb07c35372e6a327f313eb419234d8ed967ed45860fecd179.zip
module.svep[0].module.lambda-queryVCF.null_resource.archive[0]: Creation complete after 0s [id=8913785147396498047]
module.svep[0].module.lambda-createPages.null_resource.archive[0]: Creation complete after 0s [id=3655527980939772847]
module.svep[0].module.lambda-initQuery.null_resource.archive[0] (local-exec): zip: creating 'builds/949b43e6d8737b29b6fbf3b078adba05455ab5cebab437aaa6c6a9c4e30f399e.zip' archive
module.svep[0].module.lambda-initQuery.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/297/default/svep/lambda/initQuery
module.svep[0].module.lambda-initQuery.null_resource.archive[0] (local-exec): zip: adding: dynamodb.py
module.svep[0].module.lambda-initQuery.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.svep[0].module.lambda-initQuery.null_resource.archive[0] (local-exec): Created: builds/949b43e6d8737b29b6fbf3b078adba05455ab5cebab437aaa6c6a9c4e30f399e.zip
module.sbeacon.module.lambda-getIndividuals.null_resource.archive[0] (local-exec): zip: creating 'builds/54d135633142b071ec455b6045d8f1cbc9c559b03c00a6311b967298b458ab40.zip' archive
module.sbeacon.module.lambda-getIndividuals.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/297/default/sbeacon/lambda/getIndividuals
module.sbeacon.module.lambda-getIndividuals.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.sbeacon.module.lambda-getIndividuals.null_resource.archive[0] (local-exec): zip: adding: route_individuals.py
module.sbeacon.module.lambda-getIndividuals.null_resource.archive[0] (local-exec): zip: adding: route_individuals_filtering_terms.py
module.sbeacon.module.lambda-getIndividuals.null_resource.archive[0] (local-exec): zip: adding: route_individuals_id.py
module.sbeacon.module.lambda-getIndividuals.null_resource.archive[0] (local-exec): zip: adding: route_individuals_id_biosamples.py
module.svep[0].module.lambda-queryGTF.null_resource.archive[0]: Creation complete after 1s [id=1756610363679231896]
module.sbeacon.module.lambda-getGenomicVariants.null_resource.archive[0] (local-exec): zip: creating 'builds/03cd2c3a98ebceb946ba1918b071fc2ed8a8e44431aa9ceb30659f6b1a23bb97.zip' archive
module.sbeacon.module.lambda-getGenomicVariants.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/297/default/sbeacon/lambda/getGenomicVariants
module.sbeacon.module.lambda-getGenomicVariants.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.sbeacon.module.lambda-getGenomicVariants.null_resource.archive[0] (local-exec): zip: adding: route_g_variants.py
module.sbeacon.module.lambda-getGenomicVariants.null_resource.archive[0] (local-exec): zip: adding: route_g_variants_id.py
module.sbeacon.module.lambda-getGenomicVariants.null_resource.archive[0] (local-exec): zip: adding: route_g_variants_id_biosamples.py
module.sbeacon.module.lambda-getGenomicVariants.null_resource.archive[0] (local-exec): zip: adding: route_g_variants_id_individuals.py
module.sbeacon.module.lambda-getGenomicVariants.null_resource.archive[0] (local-exec): Created: builds/03cd2c3a98ebceb946ba1918b071fc2ed8a8e44431aa9ceb30659f6b1a23bb97.zip
module.sbeacon.module.lambda-getIndividuals.null_resource.archive[0] (local-exec): zip: adding: route_individuals_id_g_variants.py
module.sbeacon.module.lambda-getIndividuals.null_resource.archive[0] (local-exec): Created: builds/54d135633142b071ec455b6045d8f1cbc9c559b03c00a6311b967298b458ab40.zip
module.svep[0].module.lambda-qcNotes.null_resource.archive[0]: Creating...
module.sbeacon.module.lambda-getAnalyses.null_resource.archive[0] (local-exec): zip: creating 'builds/a7bd83ed0d8a536495679c588b7db329d03eb49388aab75337bf8432251682e3.zip' archive
module.sbeacon.module.lambda-getAnalyses.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/297/default/sbeacon/lambda/getAnalyses
module.sbeacon.module.lambda-getAnalyses.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.sbeacon.module.lambda-getAnalyses.null_resource.archive[0] (local-exec): zip: adding: route_analyses.py
module.sbeacon.module.lambda-getAnalyses.null_resource.archive[0] (local-exec): zip: adding: route_analyses_filtering_terms.py
module.sbeacon.module.lambda-getAnalyses.null_resource.archive[0] (local-exec): zip: adding: route_analyses_id.py
module.sbeacon.module.lambda-getAnalyses.null_resource.archive[0] (local-exec): zip: adding: route_analyses_id_g_variants.py
module.sbeacon.module.lambda-getDatasets.local_file.archive_plan[0]: Creating...
module.sbeacon.module.lambda-getAnalyses.null_resource.archive[0] (local-exec): Created: builds/a7bd83ed0d8a536495679c588b7db329d03eb49388aab75337bf8432251682e3.zip
module.svep[0].module.lambda-getResultsURL.null_resource.archive[0] (local-exec): zip: creating 'builds/dbf46123a8a5c0d713d746ad3c23e8bf26d84a39a32d052a473dc7c1116f5191.zip' archive
module.svep[0].module.lambda-getResultsURL.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/297/default/svep/lambda/getResultsURL
module.svep[0].module.lambda-getResultsURL.null_resource.archive[0] (local-exec): zip: adding: dynamodb.py
module.svep[0].module.lambda-getResultsURL.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.svep[0].module.lambda-getResultsURL.null_resource.archive[0] (local-exec): Created: builds/dbf46123a8a5c0d713d746ad3c23e8bf26d84a39a32d052a473dc7c1116f5191.zip
module.svep[0].module.lambda-initQuery.null_resource.archive[0]: Creation complete after 1s [id=6647327343042396996]
module.sbeacon.module.lambda-getIndividuals.null_resource.archive[0]: Creation complete after 1s [id=1471072073839405321]
module.svep[0].module.lambda-getResultsURL.null_resource.archive[0]: Creation complete after 1s [id=3238252208403833942]
module.sbeacon.module.lambda-getAnalyses.null_resource.archive[0]: Creation complete after 1s [id=5264015242492975264]
module.sbeacon.module.lambda-getGenomicVariants.null_resource.archive[0]: Creation complete after 1s [id=1496341541792036572]
module.sbeacon.module.lambda-splitQuery.null_resource.archive[0]: Creating...
module.sbeacon.module.lambda-data-portal.local_file.archive_plan[0]: Creating...
module.svep[0].module.lambda-qcNotes.null_resource.archive[0]: Provisioning with 'local-exec'...
module.svep[0].module.lambda-qcNotes.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.sbeacon.module.python_modules_layer.local_file.archive_plan[0]: Creating...
module.sbeacon.module.lambda-generateCohortVCfs.null_resource.archive[0]: Creating...
module.sbeacon.module.lambda-getDatasets.local_file.archive_plan[0]: Creation complete after 0s [id=0c8e6a4ad933bc8ee3d0a0754bf59dda85e63b5c]
module.sbeacon.module.lambda-generateReports.local_file.archive_plan[0]: Creating...
module.sbeacon.module.lambda-generateReports.local_file.archive_plan[0]: Creation complete after 0s [id=975897eb2f5f910627f7d07dcd56fc48362f10ef]
module.sbeacon.module.lambda-splitQuery.null_resource.archive[0]: Provisioning with 'local-exec'...
module.sbeacon.module.lambda-splitQuery.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.sbeacon.module.python_modules_layer.local_file.archive_plan[0]: Creation complete after 0s [id=3f9d17dd30249a3d1c197380b2beeed9616ab82a]
module.sbeacon.module.lambda-getFilteringTerms.null_resource.archive[0]: Creating...
module.cognito.module.lambda-sendRegistrationEmail.null_resource.archive[0]: Creating...
module.sbeacon.module.lambda-getEntryTypes.null_resource.archive[0]: Creating...
module.sbeacon.module.lambda-getRuns.null_resource.archive[0]: Creating...
module.sbeacon.module.lambda-data-portal.local_file.archive_plan[0]: Creation complete after 0s [id=66fb4b3796977cc57c0787426852e67029366319]
module.sbeacon.module.lambda-generateCohortVCfs.null_resource.archive[0]: Provisioning with 'local-exec'...
module.sbeacon.module.lambda-generateCohortVCfs.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.svep[0].module.lambda-qcNotes.null_resource.archive[0] (local-exec): zip: creating 'builds/7bb413b7579a5a9ccb874b45fe277268f7765ee27a3c08ee225800932d871c7c.zip' archive
module.svep[0].module.lambda-qcNotes.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/297/default/svep/lambda/qcNotes
module.svep[0].module.lambda-qcNotes.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.svep[0].module.lambda-qcNotes.null_resource.archive[0] (local-exec): Created: builds/7bb413b7579a5a9ccb874b45fe277268f7765ee27a3c08ee225800932d871c7c.zip
module.svep[0].module.python_modules_layer.local_file.archive_plan[0]: Creating...
module.sbeacon.module.lambda-getEntryTypes.null_resource.archive[0]: Provisioning with 'local-exec'...
module.sbeacon.module.lambda-getEntryTypes.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.sbeacon.module.lambda-getFilteringTerms.null_resource.archive[0]: Provisioning with 'local-exec'...
module.sbeacon.module.lambda-getFilteringTerms.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.cognito.module.lambda-sendRegistrationEmail.null_resource.archive[0]: Provisioning with 'local-exec'...
module.cognito.module.lambda-sendRegistrationEmail.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.sbeacon.module.lambda-getRuns.null_resource.archive[0]: Provisioning with 'local-exec'...
module.sbeacon.module.lambda-getRuns.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.svep[0].module.python_modules_layer.local_file.archive_plan[0]: Creation complete after 0s [id=e2b36b6f84c5bb09750e6c6f7756cb73d1982cb6]
module.svep[0].module.lambda-qcNotes.null_resource.archive[0]: Creation complete after 0s [id=4082789294759009827]
module.svep[0].aws_lambda_layer_version.binaries_layer: Creating...
module.cognito.module.lambda-customMessageLambdaTrigger.null_resource.archive[0]: Creating...
module.sbeacon.module.lambda-indexer.null_resource.archive[0]: Creating...
module.cognito.module.lambda-customMessageLambdaTrigger.null_resource.archive[0]: Provisioning with 'local-exec'...
module.cognito.module.lambda-customMessageLambdaTrigger.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.sbeacon.module.lambda-indexer.null_resource.archive[0]: Provisioning with 'local-exec'...
module.sbeacon.module.lambda-indexer.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.sbeacon.module.lambda-generateCohortVCfs.null_resource.archive[0] (local-exec): zip: creating 'builds/2fed43367c56d0422d0098b15003d4ff9ae27cf689d7cfee7a7a5289345d6cc6.zip' archive
module.sbeacon.module.lambda-generateCohortVCfs.null_resource.archive[0] (local-exec): Installing python requirements: sbeacon/lambda/generateCohortVCfs/requirements.txt
module.sbeacon.module.lambda-generateCohortVCfs.null_resource.archive[0] (local-exec): > mktemp -d terraform-aws-lambda-XXXXXXXX # /tmp/terraform-aws-lambda-7mkn0twy
module.sbeacon.module.lambda-generateCohortVCfs.null_resource.archive[0] (local-exec): > cd /tmp/terraform-aws-lambda-7mkn0twy
module.sbeacon.module.lambda-generateCohortVCfs.null_resource.archive[0] (local-exec): > python3.12 -m pip install --no-compile --prefix= --target=. --requirement=requirements.txt
module.sbeacon.module.lambda-indexer.null_resource.archive[0] (local-exec): zip: creating 'builds/aa624c03dfdae7cc1b6f9061e4ad7e5605e073652e2540f56756ee4171caf5db.zip' archive
module.sbeacon.module.lambda-indexer.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/297/default/sbeacon/lambda/indexer
module.sbeacon.module.lambda-indexer.null_resource.archive[0] (local-exec): zip: adding: USER_GUIDE.md
module.sbeacon.module.lambda-indexer.null_resource.archive[0] (local-exec): zip: adding: ctas_queries.py
module.sbeacon.module.lambda-indexer.null_resource.archive[0] (local-exec): zip: adding: generate_query_index.py
module.sbeacon.module.lambda-indexer.null_resource.archive[0] (local-exec): zip: adding: generate_query_relations.py
module.sbeacon.module.lambda-indexer.null_resource.archive[0] (local-exec): zip: adding: generate_query_terms.py
module.sbeacon.module.lambda-indexer.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.sbeacon.module.lambda-indexer.null_resource.archive[0] (local-exec): Created: builds/aa624c03dfdae7cc1b6f9061e4ad7e5605e073652e2540f56756ee4171caf5db.zip
module.sbeacon.module.lambda-splitQuery.null_resource.archive[0] (local-exec): zip: creating 'builds/76408ab6569b18b2349025a9480461ae075f7db9418cd088256937bb57a8a8ac.zip' archive
module.sbeacon.module.lambda-splitQuery.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/297/default/sbeacon/lambda/splitQuery
module.sbeacon.module.lambda-splitQuery.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.sbeacon.module.lambda-splitQuery.null_resource.archive[0] (local-exec): Created: builds/76408ab6569b18b2349025a9480461ae075f7db9418cd088256937bb57a8a8ac.zip
module.sbeacon.module.lambda-splitQuery.null_resource.archive[0]: Creation complete after 0s [id=4357600339559380178]
module.sbeacon.module.lambda-indexer.null_resource.archive[0]: Creation complete after 0s [id=1558218264675846989]
module.sbeacon.module.lambda-getProjects.null_resource.archive[0]: Creating...
module.sbeacon.module.lambda-getProjects.null_resource.archive[0]: Provisioning with 'local-exec'...
module.sbeacon.module.lambda-getProjects.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.sbeacon.module.lambda-admin.local_file.archive_plan[0]: Creating...
module.sbeacon.module.lambda-admin.local_file.archive_plan[0]: Creation complete after 0s [id=3beeddd791490c2b1e84174ea1a4ebcb8ae0abc4]
module.sbeacon.module.lambda-getConfiguration.null_resource.archive[0]: Creating...
module.sbeacon.module.lambda-getConfiguration.null_resource.archive[0]: Provisioning with 'local-exec'...
module.sbeacon.module.lambda-getConfiguration.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.sbeacon.module.lambda-getRuns.null_resource.archive[0] (local-exec): zip: creating 'builds/88930b272de54490182522f38fc6eadca926dd71de4ff726cf3de04349617ecc.zip' archive
module.sbeacon.module.lambda-getRuns.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/297/default/sbeacon/lambda/getRuns
module.sbeacon.module.lambda-getRuns.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.sbeacon.module.lambda-getRuns.null_resource.archive[0] (local-exec): zip: adding: route_runs.py
module.sbeacon.module.lambda-getRuns.null_resource.archive[0] (local-exec): zip: adding: route_runs_filtering_terms.py
module.sbeacon.module.lambda-getRuns.null_resource.archive[0] (local-exec): zip: adding: route_runs_id.py
module.sbeacon.module.lambda-getRuns.null_resource.archive[0] (local-exec): zip: adding: route_runs_id_analyses.py
module.sbeacon.module.lambda-getRuns.null_resource.archive[0] (local-exec): zip: adding: route_runs_id_g_variants.py
module.sbeacon.module.lambda-getFilteringTerms.null_resource.archive[0] (local-exec): zip: creating 'builds/454b6d5e06b61167a7515cba40e977ff31c8f2db728e6c419afec860c13d5c85.zip' archive
module.sbeacon.module.lambda-getEntryTypes.null_resource.archive[0] (local-exec): zip: creating 'builds/238c996d7bde89f739f1e7095110c69c47ce7589b588b35ea1f94beaf9b14210.zip' archive
module.cognito.module.lambda-sendRegistrationEmail.null_resource.archive[0] (local-exec): zip: creating 'builds/0ab4695261445c275b666691d159b2827f1a283a9dbdb793347795a9ed72494d.zip' archive
module.cognito.module.lambda-sendRegistrationEmail.null_resource.archive[0] (local-exec): Installing python requirements: cognito/lambda/sendRegistrationEmail/requirements.txt
module.sbeacon.module.lambda-getEntryTypes.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/297/default/sbeacon/lambda/getEntryTypes
module.sbeacon.module.lambda-getEntryTypes.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.cognito.module.lambda-sendRegistrationEmail.null_resource.archive[0] (local-exec): > mktemp -d terraform-aws-lambda-XXXXXXXX # /tmp/terraform-aws-lambda-76w5hp44
module.cognito.module.lambda-sendRegistrationEmail.null_resource.archive[0] (local-exec): > cd /tmp/terraform-aws-lambda-76w5hp44
module.sbeacon.module.lambda-getEntryTypes.null_resource.archive[0] (local-exec): Created: builds/238c996d7bde89f739f1e7095110c69c47ce7589b588b35ea1f94beaf9b14210.zip
module.cognito.module.lambda-sendRegistrationEmail.null_resource.archive[0] (local-exec): > python3.12 -m pip install --no-compile --prefix= --target=. --requirement=requirements.txt
module.sbeacon.module.lambda-getFilteringTerms.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/297/default/sbeacon/lambda/getFilteringTerms
module.sbeacon.module.lambda-getFilteringTerms.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.sbeacon.module.lambda-getFilteringTerms.null_resource.archive[0] (local-exec): Created: builds/454b6d5e06b61167a7515cba40e977ff31c8f2db728e6c419afec860c13d5c85.zip
module.sbeacon.module.lambda-getRuns.null_resource.archive[0] (local-exec): Created: builds/88930b272de54490182522f38fc6eadca926dd71de4ff726cf3de04349617ecc.zip
module.cognito.module.lambda-customMessageLambdaTrigger.null_resource.archive[0] (local-exec): zip: creating 'builds/2a66512866b4ba2207cf913d887b0861be7503e766dae546cfba8cf56e62fdc3.zip' archive
module.sbeacon.module.lambda-getEntryTypes.null_resource.archive[0]: Creation complete after 0s [id=1175552825348511342]
module.cognito.module.lambda-customMessageLambdaTrigger.null_resource.archive[0] (local-exec): Installing python requirements: cognito/lambda/customMessageLambdaTrigger/requirements.txt
module.cognito.module.lambda-customMessageLambdaTrigger.null_resource.archive[0] (local-exec): > mktemp -d terraform-aws-lambda-XXXXXXXX # /tmp/terraform-aws-lambda-w0hb86xc
module.cognito.module.lambda-customMessageLambdaTrigger.null_resource.archive[0] (local-exec): > cd /tmp/terraform-aws-lambda-w0hb86xc
module.cognito.module.lambda-customMessageLambdaTrigger.null_resource.archive[0] (local-exec): > python3.12 -m pip install --no-compile --prefix= --target=. --requirement=requirements.txt
module.sbeacon.module.lambda-getFilteringTerms.null_resource.archive[0]: Creation complete after 0s [id=3857613605057307852]
module.sbeacon.module.lambda-getMap.null_resource.archive[0]: Creating...
module.sbeacon.module.lambda-getMap.null_resource.archive[0]: Provisioning with 'local-exec'...
module.sbeacon.module.lambda-getMap.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.sbeacon.module.lambda-getBiosamples.null_resource.archive[0]: Creating...
module.sbeacon.module.lambda-getBiosamples.null_resource.archive[0]: Provisioning with 'local-exec'...
module.sbeacon.module.lambda-getBiosamples.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.sbeacon.module.lambda-getRuns.null_resource.archive[0]: Creation complete after 1s [id=3798675627198374841]
module.cognito.module.lambda-sendClinicJobEmail.null_resource.archive[0]: Creating...
module.cognito.module.lambda-sendClinicJobEmail.null_resource.archive[0]: Provisioning with 'local-exec'...
module.cognito.module.lambda-sendClinicJobEmail.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.sbeacon.module.lambda-getProjects.null_resource.archive[0] (local-exec): zip: creating 'builds/aa396856c56bc316f5429db8c17f42525a5333058192b85978c8cc8f4bb30bfe.zip' archive
module.sbeacon.module.lambda-getProjects.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/297/default/sbeacon/lambda/getProjects
module.sbeacon.module.lambda-getProjects.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.sbeacon.module.lambda-getProjects.null_resource.archive[0] (local-exec): zip: adding: utils/
module.sbeacon.module.lambda-getProjects.null_resource.archive[0] (local-exec): zip: adding: utils/__init__.py
module.sbeacon.module.lambda-getProjects.null_resource.archive[0] (local-exec): zip: adding: utils/models.py
module.sbeacon.module.lambda-getProjects.null_resource.archive[0] (local-exec): Created: builds/aa396856c56bc316f5429db8c17f42525a5333058192b85978c8cc8f4bb30bfe.zip
module.sbeacon.module.lambda-getInfo.null_resource.archive[0]: Creating...
module.sbeacon.module.lambda-getInfo.null_resource.archive[0]: Provisioning with 'local-exec'...
module.sbeacon.module.lambda-getInfo.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.sbeacon.module.lambda-getProjects.null_resource.archive[0]: Creation complete after 1s [id=2878687091239714892]
module.sbeacon.module.lambda-performQuery.null_resource.archive[0]: Creating...
module.sbeacon.module.lambda-performQuery.null_resource.archive[0]: Provisioning with 'local-exec'...
module.sbeacon.module.lambda-performQuery.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.sbeacon.module.lambda-getConfiguration.null_resource.archive[0] (local-exec): zip: creating 'builds/bdfd549747da6fdfb5247f317d63fae8452b23a25d28d2bec5c967ba3341d016.zip' archive
module.sbeacon.module.lambda-getConfiguration.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/297/default/sbeacon/lambda/getConfiguration
module.sbeacon.module.l
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.